#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/ruritoBlogger.github.io/ruritoBlogger.github.io/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/ruritoBlogger.github.io/ruritoBlogger.github.io

To view this run in a browser, visit:
https://app.terraform.io/app/rurito0125/portfolio-workspace/runs/run-th6XLu1MXZQsFszT

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.vercel_project_directory.portfolio: Reading...
data.vercel_project_directory.portfolio: Read complete after 0s [id=../frontend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # vercel_deployment.portfolio must be replaced
-/+ resource "vercel_deployment" "portfolio" {
      ~ domains     = [
          - "portfolio-xi-beryl-15.vercel.app",
          - "portfolio-ruritoblogger.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../frontend/package.json"                                                 = "908~2cb2f8f14d442d8c92b42a27282731ebd1e8523b" -> "909~1dc1a0b19307e7b43b5fb978215ffe7a63ab909f"
          ~ "../frontend/yarn.lock"                                                    = "75380~e5ea80ec2564a273f445181605f389e0525d6cd8" -> "75383~919064dcc71d94bc350925f1fc9e48f56168232e"
            # (72 unchanged elements hidden)
        }
      ~ id          = "dpl_Akgb4rGFgkBgYvGGesWXY9CtzP4J" -> (known after apply)
      + team_id     = (known after apply) # forces replacement
      ~ url         = "portfolio-c4utj0svk-ruritoblogger.vercel.app" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `called terraform plan workflow`*